app/controllers/api/greetings_controller.rb

SELECT "greetings".* FROM "greetings" ORDER BY random() LIMIT $1  [["LIMIT", 1]]
---
  def index
    greeting = Greeting.all.order('random()').first